#include <stdio.h>
main()
{
	int a[3], * p;

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p --- %d \n", *p);
	//a[0]의 값 

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+1 --- %d \n", *p+1);
	//a[0]의 값 + 1

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*(p+1) --- %d \n", *(p + 1));
	//a[0+1]의 값 
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+=1 --- %d \n", *p+=1);
	//a[0]의 값 + 1

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p++ --- %d \n", *p++);
	//후배치 : 모든 처리가 끝난 후 실행

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("(*p) --- %d \n", (*p));

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*++p --- %d \n", *++p);
	//전배치 : 먼저 실행됨

	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("++*p --- %d \n", ++*p);
	//1 + a[0]의 값 

	return 0;
}